namespace Neomaster.R7Client.Infra;

/// <summary>
/// Постоянные значения и справочные данные для работы с API "Р7-Офис. Сервер документов".
/// </summary>
public class Consts
{
  /// <summary>
  /// Коды ошибок конвертации через API "Р7-Офис. Сервер документов".
  /// </summary>
  public static readonly IReadOnlyDictionary<int, string> MapConversionErrorCodeToDescription = new Dictionary<int, string>
  {
    [0] = "Успешная конвертация",
    [-1] = "Неизвестная ошибка",
    [-2] = "Ошибка тайм-аута конвертации",
    [-3] = "Ошибка преобразования",
    [-4] = "Ошибка при загрузке файла документа для конвертации",
    [-5] = "Неправильный пароль",
    [-6] = "Ошибка при доступе к базе данных результатов конвертации",
    [-7] = "Ошибка ввода",
    [-8] = "Недействительный токен",
  };
}
